/*
 * -----------------------------------------------------------------------------------------------------------------------
 * 版权信息
 * Copyright (c) 2021.
 * Worker:JiahanYu./于家汉
 * Date:2021/10/2 上午9:43
 * 侵权必究
 * -----------------------------------------------------------------------------------------------------------------------
 *
 */

import javax.swing.*;

public class CopyrightStatement {
    public void copyright() {
        JOptionPane.showMessageDialog(null, "以下为版权声明:\n" +
                "本程序由  $于家汉$  本人自行编写. 本人承诺，该程序主要编写逻辑均出自本人之手,部分代码语法应用参考网络资料,对于其为本人提供的帮助" +
                "在此表示感谢" + ",本程序代码传播仅限于学习用途.若用于其他用途,侵权必究.");
    }

}
