/*
 * -----------------------------------------------------------------------------------------------------------------------
 * 版权信息
 * Copyright (c) 2021.
 * Worker:JiahanYu./于家汉
 * Date:2021/10/2 上午9:43
 * 侵权必究
 * -----------------------------------------------------------------------------------------------------------------------
 *
 */

public class RandomNumber {//生成随机数
    private final int random = (int) (Math.random() * 100);

    public int getRandom() {
        return random;
    }

}
